#+PROPERTY: header-args:python :session *python-QT* :results output raw :exports results
#+MACRO: SYS_NAME Quench tanks disconnect
#+MACRO: DOC_NUM EN04241
#+MACRO: P_ID F00304966

#+TITLE: Quench tanks disconnect piping amendment \newline {{{DOC_NUM}}}
#+LATEX_CLASS_OPTIONS: [titlepage]
#+OPTIONS: toc:nil tex:t

#+TOC: headlines 2
\newpage{}
#+begin_src python :results pp replate :exports none
  from wand.image import Image
  import fnmatch

  def make_pics(fname):
      """Create pictures of a PDF file with a given name"""
      pics = sorted(fnmatch.filter(os.listdir('images'), f'{fname}*.png'))
      if not pics:
          with Image(filename=f'images/{fname}.pdf', resolution = 200) as img:
              with img.convert('png') as converted:
                  converted.save(filename=f'images/{fname}_page.png')

      for pic_fn in pics:
          print(r'#+ATTR_LATEX: :width \textwidth')
          print(f'[[./images/{pic_fn}]]')
#+end_src

#+RESULTS:

#+begin_src python
  make_pics('Cover page')
#+end_src
\newpage{}
* Setup                                                            :noexport:
#+begin_src sh :exports none
killall python
#+end_src

#+RESULTS:

#+begin_src python :results output pp replace :exports none
  import heat_transfer as ht

  class Component:
      def __init__(self, name, size, source, P):
          self.name = name
          self.size = size
          self.source = source
          self.P = P

  ureg = ht.ureg
  Q_ = ht.Q_

  class Material():
      """Basic material class."""
      def __init__(self, name):
          self.name = name  # will be used in property calculations

          def kappa(self, T1, T2=None):
              """Calculate temperature conductivity at a given temperature."""
              return ht.nist_property(self.name, 'TC', T1, T2)

          def lin_exp(self, T):
              """Calculate linear expansion for given temperature"""
              try:
                  return ht.nist_property(self.name, 'LE', T)
              except KeyError:
                  return ht.nist_property(self.name, 'EC', 293*ureg.K, T)*(T-293*ureg.K)

  steel = Material('304SS')
  steel.rho = Q_('7859 kg/m**3')
  steel.S = Q_('16700 psi')  # 304L SS allowable stress
  steel.nu = 0.3  # Poisson's ratio
  steel.T_min = Q_('-425 degF')

  copper = Material('copper')
  copper.S = Q_('6000 psi')
  copper.T_min = Q_('-452 degF')

  P_des = 100 * ureg.psig
  T_des = 273 * ureg.K

  E = 0.8
  W = 1
  Y = 0.4
  pipes = [ht.piping.Pipe(1.5, SCH=10),
           ]
  for pipe in pipes:
      pipe.material = steel
      pipe.update(S=pipe.material.S, E=E, W=W, Y=Y)
  cap = ht.piping.Pipe(pipes[0].D, SCH=10)
  cap.update(S=steel.S, E=E, W=W, Y=Y) # 304 SS, welded construction
  cap.P = cap.pressure_rating()
  cap.name = 'Cap, welded'
  cap.size = cap.D
  cap.source = 'McMaster 45735K275'
  outlet = Component('Tee outlet, 304SS', 1/4, 'McMaster 4565T312', 6000*ureg.psi)
  outlet.OD = 7/8 * ureg.inch
  outlet.wall = outlet.OD - (7/16*ureg.inch+0.04444*ureg.inch)

  listed = [cap,
            outlet
  ]
  valve = ht.piping.Pipe(0.25*ureg.inch)
  valve.update(S=steel.S, E=1, W=1, Y=0.4) # 304 SS, seamless
  valve.name = 'Valve'
  valve.size = valve.D
  valve.source = 'Swagelok B-1VM4'
  valve.P = 2500*ureg.psi
  unlisted = [valve]
#+end_src

#+RESULTS:
: Python 3.7.0 (default, Aug  2 2018, 21:46:10)
: [Clang 9.1.0 (clang-902.0.39.2)] on darwin
: Type "help", "copyright", "credits" or "license" for more information.
: python.el: native completion setup failed, <class 'ImportError'>: dlopen(/Users/skoshelev/.pyenv/versions/3.7.0/lib/python3.7/lib-dynload/readline.cpython-37m-darwin.so, 2): Library not loaded: /usr/local/opt/readline/lib/libreadline.7.dylib
:   Referenced from: /Users/skoshelev/.pyenv/versions/3.7.0/lib/python3.7/lib-dynload/readline.cpython-37m-darwin.so
:   Reason: image not found

